Soap/operation/INTERNAL/INTERNAL_Samples/evaluate_INTERNAL_Full.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AMLYZE_OPERATION xmlns="urn:amlyze-services:EvaluateOperationService_v2r0">
            <CommunicationNumber>Com_96</CommunicationNumber>
            <Requester>Financial_institution</Requester>
            <OperationType>INTERNAL</OperationType>
            <RiskManagementCategory>OP_INST</RiskManagementCategory>
            <OperationExtId>Op_0096</OperationExtId>
             <SourceOfRiskLevel>EVALUATE</SourceOfRiskLevel>
            <InitializeScreeningProcesses>
                <Process>SANCTIONS</Process>
                <Process>ADVERSE_MEDIA</Process>
                <Process>PEP</Process>
            </InitializeScreeningProcesses>
            <FinancialFlowDirection>NULL</FinancialFlowDirection>
            <OperationDateTime>2023-01-08T09:09:33+02:00</OperationDateTime>
            <Currency>EUR</Currency>
            <Amount>2222</Amount>
            <SourceCountry>LT</SourceCountry>
            <DestinationCountry>LT</DestinationCountry>
            <Description>Agreement Nr 1001, 2022-10-01</Description>
            <IPAddress>555.222.757.222</IPAddress>
            <IPAddressCountry>LT</IPAddressCountry>
            <ListOperationParty>
                <OperationParty>
                    <PartyRole>DEBTOR</PartyRole>
                    <AccountNumber>LV6630800200000018155</AccountNumber>
                    <Currency>EUR</Currency> 
                    <BIC>UANFLT21XXX</BIC>
                    <BankTitle>AMLYZE UAB</BankTitle>
                    <EntityType>INDIVIDUAL</EntityType>
                    <FirstName>Geli</FirstName>
                    <LastName>Deliono</LastName>
                </OperationParty>
                <OperationParty>
                    <PartyRole>CREDITOR</PartyRole>
                    <AccountNumber>LV7730800200000018166</AccountNumber>
                    <Currency>EUR</Currency> 
                    <BIC>UANFLT21XXX</BIC>
                    <BankTitle>AMLYZE UAB</BankTitle>
                    <EntityType>INDIVIDUAL</EntityType>
                    <FirstName>Geli</FirstName>
                    <LastName>Deliono</LastName>
                </OperationParty>
            </ListOperationParty>
        </AMLYZE_OPERATION>
    </soap:Body>
</soap:Envelope>